updated airflow and tested and updated readme
